{
    "entries": [
        {
            "header": "Youtube playlists",
            "content": [
                {
                    "title": "MIT 18.06 Linear Algebra, Prof. Gilbert Strang, MIT",
                    "link": "https://www.youtube.com/playlist?list=PLE7DDD91010BC51F8"
                },
                {
                    "title": "MIT 18.065 Matrix Methods In Data Analysis, Signal Processing, and Machine Learning, Prof. Gilbert Strang, MIT",
                    "link": "https://www.youtube.com/playlist?list=PLUl4u3cNGP63oMNUHXqIUcrkS2PivhN3k"
                },
                {
                    "title": "Math 131 Real Analysis, Prof. Francis Su, Harvey Mudd College",
                    "link": "https://www.youtube.com/playlist?list=PL0E754696F72137EC"
                },
                {
                    "title": "EE364A Convex Optimization, Prof. Stephen Boyd, Stanford University",
                    "link": "https://www.youtube.com/playlist?list=PLoROMvodv4rMJqxxviPa4AmDClvcbHi6h"
                },
                {
                    "title": "Lockdown live math, Grant Sanderson, 3Blue1Brown",
                    "link": "https://www.youtube.com/playlist?list=PLZHQObOWTQDP5CVelJJ1bNDouqrAhVPev"
                }
            ]
        },
        {
            "header": "Youtube videos",
            "content": [
                {
                    "title": "Grant Sanderson, Harvey Mudd Commencement Speech 2024",
                    "link": "https://www.youtube.com/watch?v=W3I3kAg2J7w"
                },
                {
                    "title": "Alan Edelman on Julia, at TEDxMIT 2020",
                    "link": "https://www.youtube.com/watch?v=qGW0GT1rCvs"
                },
                {
                    "title": "Git Internals by John Britton of GitHub, CS50 Tech Talk",
                    "link": "https://www.youtube.com/watch?v=lG90LZotrpo&ab_channel=CS50"
                },
                {
                    "title": "Advice from the Top 1% of Software Engineer, Jean Lee",
                    "link": "https://www.youtube.com/watch?v=2JmfDKOyQcI&ab_channel=EO"
                }
            ]
        },
        {
            "header": "YouTube channels",
            "content": [
                {
                    "title":"MIT OpenCourseWare",
                    "link": "https://www.youtube.com/@mitocw7",
                    "subcontent": "Lots of lecture series. Free knowledge!"
                },
                {
                    "title":"Stanford Online",
                    "link": "https://www.youtube.com/@stanfordonline",
                    "subcontent": "Same as above."
                },
                {
                    "title":"3Blue1Brown",
                    "link": "https://www.youtube.com/@3blue1brown",
                    "subcontent": "Explanation of math-y concepts with pretty animations."
                },
                {
                    "title":"Fireship",
                    "link": "https://www.youtube.com/@Fireship",
                    "subcontent": "Latest tech news (gossip)."
                }
            ]
        },
        {
            "header": "Books",
            "content": [
                {
                    "title":"Introduction to Linear Optimization, Dimitris Bertsimas, John N. Tsitsiklis",
                    "link": "https://www.amazon.sg/Introduction-Linear-Optimization-Dimitris-Bertsimas/dp/1886529191"
                },
                {
                    "title":"Differential Equations with Applications and Historical Notes, George F. Simmons",
                    "link": "https://www.amazon.com/Differential-Equations-Applications-Historical-Mathematics/dp/1498702597"
                },
                {
                    "title":"Linear Algebra and Learning from Data, Gilbert Strang",
                    "link": "https://math.mit.edu/~gs/learningfromdata/"
                }
            ]
        },
        {
            "header": "Articles",
            "content": [
                {
                    "title": "Understanding Logistic Regression, Arun Addagatla",
                    "link": "https://medium.com/nerd-for-tech/understanding-logistic-regression-782baa868a54"
                },
                {
                    "title": "Maximum Likelihood Estimation in Logistic Regression, Arun Addagatla",
                    "link": "https://arunaddagatla.medium.com/maximum-likelihood-estimation-in-logistic-regression-f86ff1627b67"
                },
                {
                    "title": "Support Vector Machines — Soft Margin Formulation and Kernel Trick, Rishabh Misra",
                    "link": "https://medium.com/towards-data-science/support-vector-machines-soft-margin-formulation-and-kernel-trick-4c9729dc8efe"
                },
                {
                    "title": "Activation Functions Demystified, Om Pramod",
                    "link": "https://medium.com/@ompramod9921/activation-functions-demystified-4068ab7c8e1c"
                },
                {
                    "title": "Batch Norm Explained Visually — How it works, and why neural networks need it, Ketan Doshi",
                    "link": "https://towardsdatascience.com/batch-norm-explained-visually-how-it-works-and-why-neural-networks-need-it-b18919692739"
                },
                {
                    "title": "Inspecting Layer Normalization In Transformers, Ryan Partidge",
                    "link": "https://medium.com/@achronus/inspecting-layer-normalization-in-transformers-5cfab514f9b6"
                },
                {
                    "title": "What is Memoization?, Geeks for geeks",
                    "link": "https://www.geeksforgeeks.org/what-is-memoization-a-complete-tutorial/"
                },
                {
                    "title": "The Math Behind \"The Curse of Dimensionality\", Maxime Wolf",
                    "link": "https://medium.com/towards-data-science/the-math-behind-the-curse-of-dimensionality-cf8780307d74"
                }
            ]
        },
        {
            "header": "Courses at NUS that I've enjoyed",
            "content": [
                {
                    "title": "CS1010E Programming Methodology, Prof. Alan Ho, AY20-21 Sem 1",
                    "link": "https://nusmods.com/courses/CS1010E/programming-methodology",
                    "subcontent": "I took this course in my first semester at NUS. This was during the Covid era when classes were delivered online. Although I had no prior programming experience, I found that I could follow the lectures alright. They started with data types and assigning variables, then moved on to algorithm controls like loops. I recall one of the problems in the final exam was to implement John Conway's \"Game of Life\". I was quite happy when I got the expected result in the terminal. By the way, try searching \"conway's game of life\" on Google."
                },
                {
                    "title": "CS2040C Data Structures and Algorithms, Prof. Steven Halim, AY21-22 Sem 1",
                    "link": "https://nusmods.com/courses/CS2040C/data-structures-and-algorithms",
                    "subcontent": "Classes were still delivered online because of Covid. Nonetheless, Prof. Steven Halim made the learning experience fun and effective by using online tools, such as his famous visualgo.net and Discord for offline consultations. In this course I learned about common data structures like lists and trees, and sorting and searching algorithms. I recall Prof. Halim adopted a more application focused approach in his assignments, and would emphasize effective usage of data structures and algorithm flow to solve problems, instead of having students implement their own trees like how other instructors did. (Although I did feel I should do so at least once in my lifetime) One fond memory I have is the Practical Coding Exam, where we were given two coding tasks to complete in two hours. The student beside me finished the exam in 30 minutes - turns out he had several years of competitive programming experience."
                },
                {
                    "title": "IE4210 Operations Research II, Prof. Zhang Junyu, AY22-23 Sem 2",
                    "link": "https://nusmods.com/courses/IE4210/operations-research-ii",
                    "subcontent": "This course introduces problem classes and methods in operations research, such as linear programs, integer programs, the simplex method, and dynamic programming. I had a more mathematical treatment of the subject compared to the prerequisite, which was more algorithmic. I also enjoyed the weekly MATLAB assignments. I recall I would visit his office from time to time to ask about the homework/class material, but the professor would extend the discussion to deeper concepts (one memorable one was the complexity analysis of the simplex method). I really enjoyed these unexpected sidetracks as well."
                },
                {
                    "title": "MA1100 Basic Discrete Mathematics, Prof. Chin Chee Whye, AY23-24 Sem 1",
                    "link": "https://nusmods.com/courses/MA1100/basic-discrete-mathematics",
                    "subcontent": "This is a course for freshmen in the Department of Mathematics, and serves as an introduction to the fundamental language and concepts of higher level mathematics. This was my first proof-based course. I enjoyed the process of using definitions to construct arguments and gain insights about mathematical objects like sets and numbers. This course inspired me to take more courses in Math, and also to learn on my own, as (fortunately or unfortunately) I was already in my final year."
                },
                {
                    "title": "HS2301 Financial Literacy and Numeracy, Prof. Wandrille Gaultier, Naomi Hoe, Chen Kan, AY23-24 Sem 1",
                    "link": "https://nusmods.com/courses/HS2301/financial-literacy-and-numeracy",
                    "subcontent": "This course introduces basic concepts in finance and accounting. I took this course for general knowledge, wanting to learn at least the common terms and ideas in finance. I learned about investment strategies and options, accounting, risk assessment, and towards the end, blockchain and cryptocurrency mining. I recall trying pretty hard to understand the implications of long/short positions and how you would hedge against the respective risks (I've never been good with cash calculation, probably because I get confused thinking in multiple perspectives. Don't get me started on splitting bills...) But I got somewhere eventually. I also enjoyed the team presentation - my team did an overview of the 2008 GFC."
                },
                {
                    "title": "CS2113 Software Engineering & Object-Oriented Programming, Prof. Akshay Narayan, AY23-24 Sem 2",
                    "link": "https://nusmods.com/courses/CS2113/software-engineering-object-oriented-programming",
                    "subcontent": "This course introduces students to various aspects of professional software engineering, from project management models to key software engineering principles. The highlight of the course is the team project. Over 5 weeks, a team of 4 students will collaborate on a CLI app coded in Java, using GitHub for version control. I feel this course proves wrong people who claim that the skills in professional software engineering, primarily the soft ones, cannot be learnt in school. I was one of those people, until I took this course. Above all, I learned the importance of not reinventing the wheel, especially regarding coding principles (Separation of Concerns, SLAP, coding patterns, etc). Several professional coders have set forth principles they felt was important based on their experience, and as a novice in software development, it helps to follow those knowing that most likely they will turn out to be effective."
                },
                {
                    "title": "MA2101 Linear Algebra II, Prof. Brett Mcinnes, AY23-24 Sem 2",
                    "link": "https://nusmods.com/courses/MA3233/combinatorics-and-graphs-ii",
                    "subcontent": "This course featured a more conceptual exploration of Linear Algebra compared to the basic Linear Algebra course, which is more computation-heavy (e.g. find a basis of a vector space, compute the determinant of a matrix, etc). One fun point of this course is that the intructor downplays the importance of the determinant. In the prerequisite course I recall determinants were introduced using a crazy formula involving polynomials, then concepts like invertibility followed from there. In contrast the instructor (and the author of the reference book used, \"Linear Algebra Done Right\" by Sheldon Axler) left the discussion of determinants to the very last, after an exposition of linear transformations, dual vectors and spaces, and billinear forms. In fact, the Spectral Theorem was discussed even before determinants. In this course, a matrix's determinant emerges from studying the properties of the linear transformation it represents (under ANY basis, therefore 'well-defined' => 'determine' => 'determinant'). On the way you would've encountered the 'Fundamental Theorem of Linear Transformations' (a.k.a the Rank-Nullity Theorem), so you would've learned about invertibility there already, before determinants. I also enjoyed the topic of quaternions and how an extra degree of freedom in expressing a vector in 3D solves problems like the Gimbal Lock problem."
                },
                {
                    "title": "MA3233 Combinatorics and Graphs II, Prof. Huang Hao, AY23-24 Sem 2",
                    "link": "https://nusmods.com/courses/MA3233/combinatorics-and-graphs-ii",
                    "subcontent": "This course discusses basic concepts of graph theory (not so much of combinatorics, despite the course title). I learned about different families of graphs, such as bipartite graphs and trees, and graph parameters like vertex- and edge- connectivity. Ultimately I think the purpose of the course is to uncover properties of different graphs - for example, can we give a bound of a the chromatic number of planar graphs? It was a proof-based course, and for me it was at times challenging to understand, let alone think of myself, some of the proofs of theorems. The course also lets students present their proofs of problems during tutorials. I did that twice - it was truly a nerve wrecking experience, as I was put under the scrutiny of the entire class. It felt very different from the usual presentations I did in other classes. Overall I think it was a experience I couldn't get in a course in Engineering."
                },
                {
                    "title": "IE5221 Transportation Modelling and Economics, Prof. Liu Yang, AY23-24 Sem 2",
                    "link": "https://nusmods.com/courses/IE5221/transportation-modeling-and-economics",
                    "subcontent": "This course introduces concepts in transportation modelling, such as the user equillibrium model, the discrete choice model, public and private pricing, and government intervention. I felt the concepts were explained clearly with plenty of examples. I also enjoyed the class readings, which were from the American Journal of Transportation. Usually I would need a bit of effort to read and understand academic journals because of technical terms and long and complicated sentences, but the chosen articles had little of those and were easy to follow. The class assignments were light as well - two homeworks and two exams. The instructor was against the idea of 'cheatsheets' in exams, where students cram a semester worth of notes into one piece of A4 paper, and as such exams were open-notes. This is a graduate-level course, and like other graduate-level courses at NUS was conducted in the evening 6pm - 9pm. At NUS, students with final year standing are able to read graduate level courses to satisfy their graduation requirements. "
                }
            ]
        },
        {
            "header": "Learning goals",
            "content": [
                {
                    "title": "Math 421 Abstract Algebra, Prof. James Cook, Liberty University",
                    "link": "https://www.youtube.com/playlist?list=PLBY4G2o7DhF0JCgapYKrqibGaJuvV4Gkb",
                    "subcontent": "I've watched half the lectures before getting lost in the abstract concepts like group actions and the orbit stabilizer theorem. One advantage of learning through youtube is that I'm not under the pressure of homeworks and tests, but at the same time I don't force myself to really understand a concept before moving on. I hope to pick this up some time in the future."
                },
                {
                    "title": "Group Theory and the Rubik’s Cube, Janet Chen, Harvard University",
                    "link": "https://people.math.harvard.edu/~jjchen/docs/Group%20Theory%20and%20the%20Rubik's%20Cube.pdf",
                    "subcontent": "These notes are also on group theory, with a particular application on the Rubik's Cube. I've been collecting Rubik's Cubes and their variations since around 2020, and have since learned to solve a couple of them, but I hope to understand their structures mathematically."
                }
            ]
        }
    ]
}