{
    "entries": [
        {
            "header": "Youtube playlists",
            "content": [
                {
                    "title": "MIT 18.06 Linear Algebra, Prof. Gilbert Strang, MIT",
                    "link": "https://www.youtube.com/playlist?list=PLE7DDD91010BC51F8"
                },
                {
                    "title": "MIT 18.065 Matrix Methods In Data Analysis, Signal Processing, and Machine Learning, Prof. Gilbert Strang, MIT",
                    "link": "https://www.youtube.com/playlist?list=PLUl4u3cNGP63oMNUHXqIUcrkS2PivhN3k"
                },
                {
                    "title": "Math 131 Real Analysis, Prof. Francis Su, Harvey Mudd College",
                    "link": "https://www.youtube.com/playlist?list=PL0E754696F72137EC"
                },
                {
                    "title": "EE364A Convex Optimization, Prof. Stephen Boyd, Convex Optimization",
                    "link": "https://www.youtube.com/playlist?list=PLoROMvodv4rMJqxxviPa4AmDClvcbHi6h"
                }
            ]
        },
        {
            "header": "Books",
            "content": [
                {
                    "title":"Introduction to Linear Optimization, Dimitris Bertsimas, John N. Tsitsiklis",
                    "link": "https://www.amazon.sg/Introduction-Linear-Optimization-Dimitris-Bertsimas/dp/1886529191"
                },
                {
                    "title":"Differential Equations with Applications and Historical Notes, George F. Simmons",
                    "link": "https://www.amazon.com/Differential-Equations-Applications-Historical-Mathematics/dp/1498702597"
                },
                {
                    "title":"Linear Algebra and Learning from Data, Gilbert Strang",
                    "link": "https://math.mit.edu/~gs/learningfromdata/"
                }
            ]
        },
        {
            "header": "Youtube videos",
            "content": [
                {
                    "title": "Grant Sanderson, Harvey Mudd Commencement Speech 2024",
                    "link": "https://www.youtube.com/watch?v=W3I3kAg2J7w"
                },
                {
                    "title": "Alan Edelman on Julia, at TEDxMIT 2020",
                    "link": "https://www.youtube.com/watch?v=qGW0GT1rCvs"
                }

            ]
        },
        {
            "header": "Articles",
            "content": [
                {
                    "title": "The Math Behind \"The Curse of Dimensionality\", Maxime Wolf",
                    "link": "https://medium.com/towards-data-science/the-math-behind-the-curse-of-dimensionality-cf8780307d74"
                }
            ]
        },
        {
            "header": "Courses at NUS that I've enjoyed",
            "content": [
                {
                    "title": "CS1010E Programming Methodology, Prof. Alan Ho, AY20-21 Sem 1",
                    "link": "https://nusmods.com/courses/CS1010E/programming-methodology",
                    "subcontent": "I took this course in my first semester at NUS. This was during the Covid era, when classes were delivered online. Although I had no prior programming experience, I found that I could follow the lectures alright. They started with data types and assigning variables, then moved on to algorithm controls like loops. I recall one of the problems in the final exam was to implement John Conway's \"Game of Life\". I was quite satisfied when I got the expected result in the terminal. By the way, try searching \"conway's game of life\" on Google."
                },
                {
                    "title": "CS2040C Data Structures and Algorithms, Prof. Steven Halim, AY21-22 Sem 1",
                    "link": "https://nusmods.com/courses/CS2040C/data-structures-and-algorithms",
                    "subcontent": "Classes were still delivered online because of Covid. Nonetheless, Prof. Steven Halim made the learning experience fun and effective by using online tools, such as his famous visualgo.net and Discord for offline consultations. In this course I learned about common data structures like lists and trees, and sorting and searching algorithms. I recall Prof. Halim adopted a more application focused approach in his assignments, and would emphasize effective usage of data structures and algorithm flow to solve problems, instead of having students implement their own trees like how other instructors did. (Although I did feel I should do so at least once in my lifetime) One fond memory I have is the Practical Coding Exam, where we were given two coding tasks to complete in two hours. The student beside me had several years of competitive programming experience and left the venue after 30 minutes."
                },
                {
                    "title": "IE4210 Operations Research II, Prof. Zhang Junyu, AY22-23 Sem 2",
                    "link": "https://nusmods.com/courses/IE4210/operations-research-ii",
                    "subcontent": "This course introduces problem classes and methods in operations research, such as linear programs, integer programs, the simplex method, and dynamic programming. I had a more mathematical treatment of the subject compared to the prerequisite. I also enjoyed the weekly MATLAB assignments (primarily because the professor was nice enough to check my solution before submission). I recall I would visit his office to ask about the homework/class material, but the professor would extend the discussion to deeper concepts. I really enjoyed these unexpected sidetracks as well."
                },
                {
                    "title": "MA1100 Basic Discrete Mathematics, Prof. Chin Chee Whye, AY23-24 Sem 1",
                    "link": "https://nusmods.com/courses/MA1100/basic-discrete-mathematics",
                    "subcontent": "This is a course for freshmen in the Department of Mathematics, and serves as an introduction to the fundamental language and concepts of higher level mathematics. This was my first proof-based course. I enjoyed the process of using definitions to construct arguments and gain insights about mathematical objects like sets and numbers. This course inspired me to take more courses in Math, and also to learn on my own, as (fortunately or unfortunately) I was already in my final year."
                },
                {
                    "title": "HS2301 Financial Literacy and Numeracy, Prof. Wandrille Gaultier, et. al, AY23-24 Sem 1",
                    "link": "https://nusmods.com/courses/HS2301/financial-literacy-and-numeracy",
                    "subcontent": "This course introduces basic concepts in finance and accounting. I took this course for general knowledge, wanting to learn at least the common terms and ideas in finance. I learned about investment strategies and options, accounting, risk assessment, and towards the end, blockchain and cryptocurrency mining. I recall trying pretty hard to understand the implications of long/short positions and how you would hedge against the respective risks (I've never been good with cash calculation, probably because I get confused thinking in multiple perspectiev. Don't get me started on splitting bills...) But I got somewhere eventually. I also enjoyed the team presentation - my team did an overview of the 2008 GFC."
                },
                {
                    "title": "CS2113 Software Engineering & Object-Oriented Programming, Prof. Akshay Narayan, AY23-24 Sem 2",
                    "link": "https://nusmods.com/courses/CS2113/software-engineering-object-oriented-programming",
                    "subcontent": "This course introduces students to various aspects of professional software engineering, from project management models to key software engineering principles. The highlight of the course is the team project. Over 5 weeks, a team of 4 students will collaborate on a CLI app coded in Java, using GitHub for version control. I like this course as it a proves wrong people who claim that the hard and soft skills of professional software engineering cannot be learnt in school. I was one of those people, until I took this course. Above all, I learned the importance of not reinventing the wheel, especially regarding coding principles (Separation of Concerns, SLAP, coding patterns, etc). Indeed, several professional coders have set forth principles they felt was important based on their experience, and as a novice in software development, it helps to follow those, which have proof or backing that will turn out effective."
                },
                {
                    "title": "MA2101 Linear Algebra II, Prof. Brett Mcinnes, AY23-24 Sem 2",
                    "link": "https://nusmods.com/courses/MA3233/combinatorics-and-graphs-ii",
                    "subcontent": "This course featured a more conceptual exploration of Linear Algebra compared to the basic Linear Algebra course, which is more computation-heavy (e.g. find a basis of a vector space, compute the determinant of a matrix, etc) One fun point of this course is that the intructor downplays the importance of the determinant. In the prerequisite course I recall determinants were introduced using a crazy formula involving polynomials, then concepts like invertibility followed from there (or at least interconnected in some way). In contrast the instructor (and the author of the reference book used, \"Linear Algebra Done Right\" by Sheldon Axler) left the discussion of determinants to the very last, after an exposition of linear transformations, dual vectors and spaces, and billinear forms. In fact, the Spectral Theorem was discussed even before determinants. In this course, a matrix's determinant emerges from studying the properties of the linear transformation it represents (under ANY basis, therefore 'well-defined' => 'determine' => 'determinant'). I also enjoyed the topic of quaternions and how an extra degree of freedom in expressing a vector in 3D solves problems like the Gimbal Lock problem."
                },
                {
                    "title": "MA3233 Combinatorics and Graphs II, Prof. Huang Hao, AY23-24 Sem 2",
                    "link": "https://nusmods.com/courses/MA3233/combinatorics-and-graphs-ii",
                    "subcontent": "This course discusses basic concepts of graph theory (not so much of combinatorics, despite the course title). I learned about different families of graphs, such as bipartite graphs and trees, and graph parameters like connectivity and chromatic number. Ultimately I think the purpose of the course is to uncover properties of different graphs - for example, can we give a bound of a certain parameter of a given graph or a family of them? It was a proof-based course, and for me it was at times challenging to understand, let alone think of myself, some of the proofs of theorems. The course also lets students present their proofs of problems during tutorials. I did that twice - it was truly a nerve wrecking experience, as I was put under the scrutiny of the entire class. It just felt different from the usual presentations I did in other classes. Overall I think it was a experience I couldn't get in a course in Engineering."
                }
            ]
        },
        {
            "header": "Learning goals",
            "content": [
                {
                    "title": "Math 421 Abstract Algebra, Prof. James Cook, Liberty University",
                    "link": "https://www.youtube.com/playlist?list=PLBY4G2o7DhF0JCgapYKrqibGaJuvV4Gkb"
                }
            ]
        }
    ]
}